In [3]:
import pandas as pd
import numpy as np

In [31]:
df = pd.DataFrame(np.random.randint(10, size=(8, 4)), columns=['col1', 'col2', 'col3', 'col4'])
df

   col1  col2  col3  col4
0     9     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5
5     6     0     4     8
6     1     3     5     2
7     0     6     9     9

## .head()

In [23]:
# Visualizando as 5 primeiras linhas
df.head()

   col1  col2  col3  col4
0     5     3     6     9
1     8     9     0     1
2     4     9     5     9
3     6     8     6     4
4     4     6     1     2

In [24]:
# Visualizando as primeiras n linhas (trÃªs neste caso)
df.head(3)

   col1  col2  col3  col4
0     5     3     6     9
1     8     9     0     1
2     4     9     5     9

In [45]:
# Para valores negativos de n
df = df.head(-3)
df

   col1  col2  col3  col4
0     9     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5

## .at

In [65]:
df

   col1  col2  col3  col4
0    55     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5

In [49]:
# Obtenha o valor no par de linha/coluna especificado

df.at[0, 'col1']  # [0,0]

9

In [54]:
# Defina o valor no par de linha / coluna especificado
df.at[0, 'col1'] = 55
df.at[0, 'col1']

55

In [60]:
# Gerando serie da linha 2
df.loc[2]

col1    6
col2    7
col3    4
col4    9
Name: 2, dtype: int32

In [63]:
# Obtenha valor dentro de uma sÃ©rie
df.loc[2].at['col4']

9

## .iat

In [64]:
df

   col1  col2  col3  col4
0    55     3     1     0
1     0     4     9     8
2     6     7     4     9
3     2     5     5     1
4     6     4     6     5

In [68]:
# Obtenha o valor no par de linha / coluna especificado
df.iat[0, 0]

55

In [81]:
# Defina o valor no par de linha / coluna especificado
df.iat[0, 0] = 9
df.iat[0, 0]

9

In [82]:
# Gerando serie da linha 1
df.loc[1]

col1    0
col2    4
col3    9
col4    8
Name: 1, dtype: int32

In [83]:
# Obtenha valor dentro de uma sÃ©rie
df.loc[1].iat[1]

4

## .loc

In [23]:
df = pd.DataFrame(data=np.random.randint(10, size=(4, 4)), index=['L1', 'L2', 'L3', 'L4'], columns=['C1', 'C2', 'C3', 'C4'])
df

    C1  C2  C3  C4
L1   1   1   4   5
L2   6   6   7   2
L3   1   5   5   8
L4   5   5   2   7

In [9]:
# Etiqueta Ãºnica. Observe que isso retorna a linha como uma sÃ©rie.
df.loc['L1']

C1    1
C2    6
C3    9
C4    7
Name: L1, dtype: int32

In [10]:
# Lista de rÃ³tulos. Observe que usar [[]] retorna um DataFrame.
df.loc[['L1', 'L3']]

    C1  C2  C3  C4
L1   1   6   9   7
L3   4   9   2   4

In [12]:
# RÃ³tulo Ãºnico para linha e coluna
df.loc['L1', 'C3']

9

In [16]:
# atia com rÃ³tulos para linha e rÃ³tulo Ãºnico para coluna. Conforme mencionado acima, 
# observe que o inÃ­cio e a parada da fatia estÃ£o incluÃ­dos.

df.loc['L2': 'L4', 'C2'] # do L2 ao L4 da coluna C2

L2    3
L3    9
L4    9
Name: C2, dtype: int32

In [6]:
# Lista booleana com o mesmo comprimento do eixo da linha

df.loc[[False, False, True, False]]

    C1  C2  C3  C4
L3   1   3   6   7

In [8]:
# Condicional que retorna uma sÃ©rie booleana
df.loc[df['C3'] > 5]  # Exibir valores da C3 menor que 5

    C1  C2  C3  C4
L1   3   7   9   0
L2   0   5   9   0
L3   1   3   6   7

In [10]:
df.loc[df['C3'] > 5, ['C4']] # exibindo somente a coluna especificada

    C4
L1   0
L2   0
L3   7

In [14]:
# Lambda que retorna uma sÃ©rie booleana
df.loc[lambda df: df['C3'] == 9]

    C1  C2  C3  C4
L1   3   7   9   0
L2   0   5   9   0

### .loc (Valores de configuraÃ§Ã£o)

In [24]:
df

    C1  C2  C3  C4
L1   1   1   4   5
L2   6   6   7   2
L3   1   5   5   8
L4   5   5   2   7

In [25]:
# Defina o valor para todos os itens que correspondem Ã  lista de rÃ³tulos
df.loc[['L3', 'L1'], ['C3']] = 50
df

    C1  C2  C3  C4
L1   1   1  50   5
L2   6   6   7   2
L3   1   5  50   8
L4   5   5   2   7

In [28]:
# Defina o valor para uma linha inteira
df.loc['L1'] = 20
df

    C1  C2  C3  C4
L1  20  20  20  20
L2   6   6   7   2
L3   1   5  50   8
L4   5   5   2   7

In [29]:
# Defina o valor para uma coluna inteira
df.loc[:, 'C3'] = 30